/* 
  Localizable.strings
  dialog

  Created by Bart Reardon on 29/5/2022.
  
*/

// error sheet
"One or more input fields are incorrect" = "Yksi tai useampi syöttökenttä on virheellinen";
"is required" = "on pakollinen";
"doesn't match the required format" = "ei vastaa vaadittua muotoa";

// required fields text
"* Required Fields" = "* Pakolliset kentät";

//buttons
"Cancel" = "Peruuta";
"More Information" = "Lisätietoja";
"OK" = "OK";
"Select" = "Valitse";

//default text
"default-title" = "";
"default-message" = "";
"Click for additional information" = "Napsauta saadaksesi lisätietoja";

"Confirm" = "Vahvistaa";
"Downloading" = "Ladataan";

"confirmation failed  <br>values do not match" = "vahvistus epäonnistui <br>arvot eivät täsmää";

//constructor kit labels
"Welcome to the swiftDialog builder"            = "Tervetuloa swiftDialog builderiin";
"Select properties on the left to modify. swiftDialog will update to show the changes in realtime"        = "Valitse muokattavat ominaisuudet vasemmalta. swiftDialog päivittyy ja näyttää muutokset reaaliajassa";
"Basic"              = "Perus";
"Content"            = "Sisältö";
"Window"             = "Ikkuna";
"Sidebar"            = "Sivupalkki";
"Data Entry"          = "Tiedon syöttö";
"Buttons"            = "Painikkeet";
"Advanced"           = "Pitkälle kehittynyt";
"List Items"          = "Luettelon kohteet";
"Images"             = "Kuvat";
"Media"              = "Media";
"Output"             = "lähtö";
"JSON Output"         = "JSON-lähtö";
"Quit"              = "Lopettaa";
"Export Command"      = "Vientikomento";
"Title"              = "Otsikko";
"Colour"             = "Väri";
"Reset"              = "Palauta";
"Font Size: "           = "Fonttikoko: ";
"value:"              = "arvo:";
"Message"           = "Viesti";
"Text Alignment"      = "Tekstin tasaus";
"Vertical Position"   = "Pysty asento";
"Window Height"       = "Ikkunan korkeus";
"Height value:"        = "Korkeusarvo:";
"Window Width"        = "Ikkunan leveys";
"Width value:"         = "Leveyden arvo:";
"Window Properties"   = "Ikkunan ominaisuudet";
"Preset Sizes"        = "Esiasetetut koot";
"Small"              = "Pieni";
"Big"                = "Iso";
"Screen Background Blur"         = "Näytön taustan hämärtyminen";
"Movable"            = "Liikkuva";
"Force on Top"         = "Voima päällä";
"Progress Bar"        = "Edistymispalkki";
"Progress value:"      = "Edistyksen arvo:";
"Progress Text:"       = "Edistysteksti:";
"Banner Image"        = "Bannerikuva";
"Select"             = "Valitse";
"Watermark"          = "Vesileima";
"Fill"               = "Täyttää";
"Opacity"              = "Alfa";
"Scale"              = "Skaala";
"Position"           = "Sijainti";
"Icon"               = "Ikoni";
"Visible"            = "näkyvä";
"Centred"            = "keskitetty";
"Select"             = "Valitse";
"Icon Size"           = "Ikonin koko";
"Size value:"          = "Koon arvo:";
"Overlay"            = "Peittokuva";
"Infobox"            = "Infobox";
"Infotext"           = "Infoteksti";
"Info Text"      = "Tietoksti";
"Button1"            = "Button1";
"Button2"            = "Button2";
"Info Button"    = "Info-painike";
"Quit on Info"         = "Lopeta tiedosta";
"Label: "              = "Etiketti:";
"Info Button Action: "   = "Info-painikkeen toiminto:";
"AutoPlay"           = "Automaattinen toisto";
"Autoplay Seconds"    = "Autoplay Seconds";
"Path"               = "Polku";
"Caption"            = "Tekstitys";
"Status Text"         = "Tilateksti";
"Status"             = "Tila";
"Format output as JSON"         = "Alusta tuloste JSON-muodossa";
"Textfields"         = "Tekstikentät";
"Show"               = "Näytä";
"Required"           = "Edellytetään";
"Secure"             = "Turvallinen";
"Prompt"             = "Kehote";
"Regex"              = "Regex";
"Regex Error"         = "Regex-virhe";
"Select"             = "Valitse";
"Checkbox"           = "Valintaruutu";
"Video"              = "Video";
"Filename"           = "Tiedoston nimi";
"Web"                = "Web";
"URL"                = "URL";
"Disabled"           = "Liikuntarajoitteinen";
"Enabled"            = "Käytössä";
